app/controllers/api/v1/sharts_controller.rb

  def getChartByID
    chart = Chart.find_by(code: params[:id])
---
SELECT "charts".* FROM "charts" WHERE "charts"."code" = 'PIQAH' LIMIT 1