app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ('mariojuniorsoaresdev@gmail.com', 'senha123', '2025-09-13 11:54:52.414923', '2025-09-13 11:54:52.414923') RETURNING "id"
---
  def createAdmin
    @user = User.new(user_params)

    if @user.save