ruby-rails-back/app/controllers/api/v1/auth_controller.rb

  def login
    usuario = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'mariojuniorsoaresdev@gmail.com' LIMIT 1