ruby-rails-back/app/controllers/api/v1/caixa_controller.rb

INSERT INTO "movimentacaos" ("tipo", "nome", "descricao", "valor", "created_at", "updated_at", "caixa_id") VALUES ('entrada', 'Nova hehe', 'descfri', 88.0, '2025-09-16 16:17:46.328625', '2025-09-16 16:17:46.328625', 1) RETURNING "id", "data"
---
  def cadastrarMovimentacao
    puts ("heheheh")
    puts (mov_params)
    movimentacao = Movimentacao.new(mov_params)
    puts ("after")
    if movimentacao.save

SELECT "movimentacaos".* FROM "movimentacaos" ORDER BY "movimentacaos"."data" DESC
---
  def listarMovimentacoes
    movimentacoes = Movimentacao.order(data: :desc)

SELECT "movimentacaos".* FROM "movimentacaos" WHERE "movimentacaos"."id" = 4 LIMIT 1
DELETE FROM "movimentacaos" WHERE "movimentacaos"."id" = 4
---
  def deletarMovimentacao
    movimentacao = Movimentacao.find_by(id: params[:id])
    return render json: { message: "Movimentação não encontrada" }, status: :not_found unless movimentacao

    movimentacao.destroy!

SELECT "caixas".* FROM "caixas" ORDER BY "caixas"."id" ASC LIMIT 1
INSERT INTO "caixas" ("saldo_total", "saldo_estimado", "data_atualizacao", "created_at", "updated_at") VALUES (0.0, 0.0, '2025-09-16 14:10:19.378127', '2025-09-16 14:10:19.378219', '2025-09-16 14:10:19.378219') RETURNING "id", "data_atualizacao"
---
  def obterCaixa
    caixa = Caixa.first
    unless caixa
      caixa = Caixa.create!(saldo_total: 0, saldo_estimado: 0)