ruby-rails-back/app/controllers/api/v1/produtos_controller.rb

  def createProduct
    if !params[:img]
      return render json: { message: 'Pelo menos uma imagem é obrigatória.' }, status: 400
    end

    # Salva as imagens localmente (ou via Active Storage se preferir)
    imagens_paths = Array.wrap(params[:img]).map do |imagem|
      path = Rails.root.join('public', 'uploads', imagem.original_filename)
      File.open(path, 'wb') { |f| f.write(imagem.read) }
      "/uploads/#{imagem.original_filename}"
    end


    produto = Produto.new(
      nome: params[:nome],
      descricao: params[:descricao],
      preco: params[:preco],
      preco_com_desconto: params[:precoComDesconto],
      categoria: params[:categoria],
      estoque: params[:estoque],
      img: imagens_paths,
      reserva: ActiveModel::Type::Boolean.new.cast(params[:reserva]),
      visivel: ActiveModel::Type::Boolean.new.cast(params[:visivel])
    )

    if produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "preco_com_desconto", "categoria", "estoque", "img", "reserva", "visivel", "created_at", "updated_at") VALUES ('Pingente Zircônia', '', 34.0, 33.99, 'brincos', 1, '{/uploads/8378225.jpg}', TRUE, TRUE, '2025-09-13 14:12:20.827564', '2025-09-13 14:12:20.827564') RETURNING "id"

  def listProducts
    produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

  def productUpdate
    produto = Produto.find_by(id: params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 1 LIMIT 1

    produto.visivel            = ActiveModel::Type::Boolean.new.cast(params[:visivel]) unless params[:visivel].nil?
    produto.img                = imagens_paths

    if produto.save
---
UPDATE "produtos" SET "nome" = 'Pingente Zircônia editado', "preco" = 40.0, "preco_com_desconto" = 39.99, "updated_at" = '2025-09-13 14:54:53.484777' WHERE "produtos"."id" = 1

  def getProductByID
    produto = Produto.find_by(id: params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 1 LIMIT 1